---
title: RenderingSettings
classe: Autodesk.Revit.DB.RenderingSettings
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 15
---

# RenderingSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `BackgroundStyle BackgroundStyle { get; set; }` | `renderingSettings.BackgroundStyle` | BackgroundStyle |
| `Boolean IsValidObject { get; }` | `renderingSettings.IsValidObject` | Boolean |
| `LightingSource LightingSource { get; set; }` | `renderingSettings.LightingSource` | LightingSource |
| `PrinterResolution PrinterResolution { get; set; }` | `renderingSettings.PrinterResolution` | PrinterResolution |
| `ResolutionTarget ResolutionTarget { get; set; }` | `renderingSettings.ResolutionTarget` | ResolutionTarget |
| `Int32 ResolutionValue { get; }` | `renderingSettings.ResolutionValue` | Int32 |
| `Boolean UsesRegionRendering { get; set; }` | `renderingSettings.UsesRegionRendering` | Boolean |
| `Void Dispose()` | `renderingSettings.Dispose()` | Void |
| `BackgroundSettings GetBackgroundSettings()` | `renderingSettings.GetBackgroundSettings()` | BackgroundSettings |
| `RenderingImageExposureSettings GetRenderingImageExposureSettings()` | `renderingSettings.GetRenderingImageExposureSettings()` | RenderingImageExposureSettings |
| `RenderingQualitySettings GetRenderingQualitySettings()` | `renderingSettings.GetRenderingQualitySettings()` | RenderingQualitySettings |
| `Outline GetRenderingRegionOutline()` | `renderingSettings.GetRenderingRegionOutline()` | Outline |
| `Void SetBackgroundSettings(BackgroundSettings)` | `renderingSettings.SetBackgroundSettings(background)` | Void |
| `Void SetRenderingImageExposureSettings(RenderingImageExposureSettings)` | `renderingSettings.SetRenderingImageExposureSettings(exposure)` | Void |
| `Void SetRenderingQualitySettings(RenderingQualitySettings)` | `renderingSettings.SetRenderingQualitySettings(settings)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```